Revit 2027 API
Application.SystemsAnalysisWorkfilesRootPath Property
 Root path for systems analysis workfiles
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SystemsAnalysisWorkfilesRootPath { get; }
Public ReadOnly Property SystemsAnalysisWorkfilesRootPath As String
	Get
public:
property String^ SystemsAnalysisWorkfilesRootPath {
	String^ get ();
}
member SystemsAnalysisWorkfilesRootPath : string with get
Property Value
String
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace